print("===โปรเเกรมคำนวณการใช้สีทาบ้านภายนอก===")
width = float(input("กรุณากรอก ความกว้าง ของบ้าน (เมตร): "))
long1 = float(input("กรุณากรอก ความยาว ของบ้าน (เมตร): "))
high = float(input("กรุณากรอก ความสูง ของบ้าน (เมตร): "))
color = 2.5

m2 = (width*high*2)+(long1*high*2)#หาพื้นที่
liter = m2/color
can = liter / 4

print()
print("===สรุปผลการคำนวณ===")
print(f"พื้นทีผนังภายนอกทั้งหมด : {m2}  ตารางเมตร")
print(f"ปริมาณสีที่ต้องใช้รวม : {liter} ลิตร")
print(f"จำนวนสีกระปองที่่ต้องซื้อ : {int(can)} กระป๋อง")
print(f"จำนวนเงินค่าสีทั้งหมด : {int(can*200)} บาท")
